In [1]:
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')
import os
os.getcwd()

'C:\\Users\\anuka'

In [2]:
df = pd.read_csv(r"C:\Users\anuka\Desktop\shopping_mall.csv", d

In [3]:
df.describe()

           Quantity    UnitPrice    CustomerID
count  75120.000000  75120.00000  48212.000000
mean       9.043384      5.25234  15257.869327
std      387.339709    116.75314   1765.475916
min   -74215.000000      0.00000  12346.000000
25%        1.000000      1.25000  13767.000000
50%        3.000000      2.46000  15078.000000
75%        9.000000      4.24000  16916.000000
max    74215.000000  16888.02000  18283.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75120 entries, 0 to 75119
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    75120 non-null  object
 1   StockCode    75120 non-null  object
 2   Description  74915 non-null  object
 3   Quantity     75120 non-null  int64
 4   InvoiceDate  75120 non-null  object
 5   UnitPrice    75120 non-null  float64
 6   CustomerID   48212 non-null  float64
 7   Country      75120 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 4.6+ MB

In [5]:
df.isnull().sum()

InvoiceNo          0
StockCode          0
Description      205
Quantity           0
InvoiceDate        0
UnitPrice          0
CustomerID     26908
Country            0
dtype: int64

In [6]:
df1 = df.dropna(axis=0)

In [7]:
df1.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [8]:
df1 = df1.drop(["StockCode", "Description", "Country"], axis = 1)

In [9]:
df1['expenditure']= df.apply(lambda row: row.Quantity * row.UnitPrice, axis = 1)

In [10]:
df1

      InvoiceNo  Quantity      InvoiceDate  UnitPrice  CustomerID  expenditure
0        536627         1  12/2/2010 10:53      19.95     15658.0        19.95
1        536627         2  12/2/2010 10:53       8.50     15658.0        17.00
2        536627         3  12/2/2010 10:53       5.95     15658.0        17.85
3        536627        12  12/2/2010 10:53       1.45     15658.0        17.40
4        536627         4  12/2/2010 10:53      12.75     15658.0        51.00
...         ...       ...              ...        ...         ...          ...
75115    556023         1   6/8/2011 12:21       4.95     14527.0         4.95
75116    556023         4   6/8/2011 12:21       0.83     14527.0         3.32
75117    556023         4   6/8/2011 12:21       0.55     14527.0         2.20
75118    556023         4   6/8/2011 12:21       1.65     14527.0         6.60
75119    556023         2   6/8/2011 12:21       5.95     14527.0        11.90

[48212 rows x 6 columns]